using System;

namespace MyApp
{
    internal class Program
    {
        static void Main(string[] args)
        {
            for (int i = 1; i <= 1000; i++) // Съкратения вариант е for (int i = 7; i <= 997; i++) така спестяваме няколко изпълнения на цикъла( това се прави защото от 1 до 6 няма цифра която да завършва на 7 и същото е и след 997 до 1000  // И другият вариант в който не ти трябва if e for (int i = 1; i <= 1000; i+=10) // i+=10 --> i = i+10
            {
                if (i % 10 == 7) // Така се намираше последната цифра на числото като разделим процентно(%) на 10  
                {
                    Console.WriteLine(i);
                }
            }

        }
    }
}